app/controllers/microposts_controller.rb

  def destroy
    @micropost= current_user.microposts.find(params[:id])
    if @micropost.present?
      @micropost.destroy
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 4]]